/*********************************************************************************************************
* 模块名称: ADC.h
* 摘    要: ADC驱动
* 当前版本: 1.0.0
* 作    者: SZLY(COPYRIGHT 2018 SZLY. All rights reserved.)
* 完成日期: 2018年04月19日
* 内    容:
* 注    意: none                                                                  
**********************************************************************************************************
* 取代版本:	 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/
#ifndef _ADC_H_
#define _ADC_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "stm32f4xx.h"
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define USER_DEFINE_ADC                  ADC3                       //用户定义ADC
#define USER_DEFINE_ADC_CLK              RCC_APB2Periph_ADC3        //用户定义ADC的时钟
#define USER_DEFINE_ADC_CHANNEL          ADC_Channel_6              //用户定义ADC的通道
#define USER_DEFINE_ADC_GPIO_PORT        GPIOF                      //用户定义ADC通道的GPIO端口
#define USER_DEFINE_ADC_GPIO_PIN         GPIO_Pin_8                 //用户定义ADC通道的GPIO的引脚

#define USER_DEFINE_ADC_GPIO_CLK         RCC_AHB1Periph_GPIOF       //用户定义ADC通道的GPIO的时钟

#define USER_DEFINE_ADC_IRQ              ADC_IRQn                   //ADC中断宏定义
#define USER_DEFINE_ADC_IRQHandler       ADC_IRQHandler             //ADC中断服务函数

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void InitADC(void);                    //初始化ADC
u16  GetADCAverage(u8 sampletimes);    //获取ADC采样数据的平均值

#endif
