/*********************************************************************************************************
* 模块名称: RCC.c
* 摘    要: RCC模块，包含各种时钟的配置
* 当前版本: 1.0
* 作    者: SZLY(COPYRIGHT 2018 SZLY. All rights reserved.)
* 完成日期: 2018年01月01日 
* 内    容: 
* 注    意: none                                                                  
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "RCC.h"
#include <stm32f4xx_conf.h>

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static  void  ConfigRCC(void);  //配置RCC

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: ConfigRCC
* 函数功能: 配置RCC 
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注    意: 配置的时钟如下所述：
*           （0）外部晶振HSE = 25MHz
*           （1）PLLCLK（PLL时钟）= HSE/25*360/2 = 180MHz
*           （2）SYSCLK（系统时钟）= PLLCLK = 180MHz
*           （3）HCLK（AHB总线时钟）= SYSCLK = 180MHz
*           （4）PCLK1（APB1总线时钟）= HCLK/4 = 45MHz（APB1 Timer Clock=90MHz）
*           （5）PCLK2（APB2总线时钟）= HCLK/2 = 90MHz（APB2 Timer Clock=180MHz）
*           （6）Ethernet PTP Clock = 180MHz
*           （7）Memory and DMA Clock = 180MHz
*           （8）Cortex System Timer = 180MHz
*           （9）FCLK Cortex Clock = 180MHz
*********************************************************************************************************/
static void ConfigRCC(void)
{
  __IO uint32_t HSEStartUpStatus = 0;
  
  // 使能HSE，开启外部晶振，F429使用 HSE=25M
  RCC_HSEConfig(RCC_HSE_ON);
  
  // 等待HSE启动稳定
  HSEStartUpStatus = RCC_WaitForHSEStartUp();

  if(SUCCESS == HSEStartUpStatus)
  {
    // 调压器电压输出级别配置为1，以便在器件为最大频率
    // 工作时使性能和功耗实现平衡
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;
    PWR->CR |= PWR_CR_VOS;
  
    // HCLK = SYSCLK / 1
    RCC_HCLKConfig(RCC_SYSCLK_Div1);

    // PCLK2 = HCLK / 2
    RCC_PCLK2Config(RCC_HCLK_Div2);
    
    //PCLK1 = HCLK / 4
    RCC_PCLK1Config(RCC_HCLK_Div4);
    
    //如果要超频就得在这里下手啦
    //设置PLL来源时钟，设置VCO分频因子m，设置VCO倍频因子n，
    //设置系统时钟分频因子p，设置OTG FS,SDIO,RNG分频因子q
    //HSE / 25 *360 / 2 = 180
    RCC_PLLConfig(RCC_PLLSource_HSE, 25, 360, 2, 4);
    
    //使能PLL
    RCC_PLLCmd(ENABLE);
  
    //等待PLL稳定
    while (RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET)
    {
      
    }   

    /*-----------------------------------------------------*/
    //开启OVER-RIDE模式，以能达到更高频率
    PWR->CR |= PWR_CR_ODEN;
    while((PWR->CSR & PWR_CSR_ODRDY) == 0)
    {
      
    }
    PWR->CR |= PWR_CR_ODSWEN;
    while((PWR->CSR & PWR_CSR_ODSWRDY) == 0)
    {
      
    }      
    //配置FLASH预取指,指令缓存,数据缓存和等待状态
    FLASH->ACR = FLASH_ACR_PRFTEN 
               | FLASH_ACR_ICEN 
               | FLASH_ACR_DCEN 
               | FLASH_ACR_LATENCY_5WS;
    /*-----------------------------------------------------*/
  
    //当PLL稳定之后，把PLL时钟切换为系统时钟SYSCLK
    RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);

    //读取时钟切换状态位，确保PLLCLK被选为系统时钟
    while (RCC_GetSYSCLKSource() != 0x08)
    {
      
    }
  }
  else
  {
    //HSE启动出错处理
    while (1)
    {
      
    }
  }
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: InitRCC
* 函数功能: 初始化RCC模块 
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注    意: 
*********************************************************************************************************/
void InitRCC(void)
{
  ConfigRCC();    //配置RCC
}
