/*********************************************************************************************************
* 模块名称: DAC.c
* 摘    要: 
* 当前版本: 1.0.0
* 作    者: SZLY(COPYRIGHT 2018 SZLY. All rights reserved.)
* 完成日期: 2018年03月01日
* 内    容:
* 注    意: none                                                                  
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DAC.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: InitDAC
* 函数功能: 初始化DAC通道1输出
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年04月22日
* 注    意: 
*********************************************************************************************************/
void InitDAC(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;    //定义结构体DAC_InitStructure，用来配置DAC  
	DAC_InitTypeDef  DAC_InitStructure;     //定义结构体GPIO_InitStructure，用来配置DAC通道的GPIO

	RCC_AHB1PeriphClockCmd(USER_DEFINE_DAC_CH1_GPIO_CLK, ENABLE);   //使能DAC通道的GPIO端口时钟
  RCC_APB1PeriphClockCmd(USER_DEFINE_DAC_CLK, ENABLE);            //使能DAC的时钟
                                                      
  GPIO_InitStructure.GPIO_Pin =  USER_DEFINE_DAC_CH1_GPIO_PIN;    //设置GPIO的引脚
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;                   //模拟输入模式
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;                //设置为非上下拉
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;              //I/O口速率100MHz
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;                  //推挽模式
  GPIO_Init(USER_DEFINE_DAC_CH1_GPIO_PORT, &GPIO_InitStructure);  //根据参数初始化GPIO
	
//  DAC_InitStructure.DAC_Trigger = DAC_Trigger_None;						            //不使用触发功能
  DAC_InitStructure.DAC_Trigger = DAC_Trigger_Software;						          //软件触发
  DAC_InitStructure.DAC_WaveGeneration = DAC_WaveGeneration_None;	          //不使用波形发生器
  DAC_InitStructure.DAC_LFSRUnmask_TriangleAmplitude = DAC_LFSRUnmask_Bit0; //不产生噪声波形
  DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Disable;	          //DAC输出缓存关闭
	DAC_Init(USER_DEFINE_DAC_CH1_CHANNEL, &DAC_InitStructure);                //初始化DAC通道
  DAC_Cmd(USER_DEFINE_DAC_CH1_CHANNEL, ENABLE);                             //使能DAC
  
  DAC_SetChannel1Data(DAC_Align_12b_R, 0);           //设置DAC通道1的值，且采用12位右对齐数据格式
}

/*********************************************************************************************************
* 函数名称: SetDACVol
* 函数功能: 设置DAC通道输出电压
* 输入参数: volnum:0-3300,代表0-3.3V
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年03月01日
* 注    意: 
*********************************************************************************************************/
void SetDACVol(u16 volnum)
{
	float temp = volnum;                               //将输入参数赋值给temp
  
	temp /= 1000;                                      //temp值为设置的电压值
  
	temp = temp * 4096 / 3.3f;                         //通过公式计算DOR寄存器的值,加f去掉双精度提示
  
  DAC_SetChannel1Data(DAC_Align_12b_R, temp);        //设置DAC通道1的值，且采用12位右对齐数据格式
  
  DAC_SoftwareTriggerCmd(DAC_Channel_1,ENABLE);      //软件开启转换
}
